# IsSystemDividable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..IsSystemDividable Method
MEPSystem Class See Also
---
Checks if the system is dividable. The system is dividable if there is more than one physical network in the system. Currently, only HVAC and piping systems support dividing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsSystemDividable()
```

Visual Basic
---
```text
Public Function IsSystemDividable As Boolean
```

Visual C++
---
```text
public:
bool IsSystemDividable()
```

# ### Return Value
True if the system can be divided.
# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace